// Напишите программу, которая на вход принимает число и выдает его квадрат.
Console.WriteLine("Введите число: ");
int nam = int.Parse(Console.ReadLine());
Console.WriteLine("Квадрат равен =  " + nam * nam);
